tap "anomalyco/tap"
tap "codecrafters-io/tap"
tap "homebrew/cask-versions"
tap "quarylabs/quary"
tap "romkatv/powerlevel10k"
brew "awscli"
brew "bat"
brew "btop"
brew "cmake"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gnu-sed"
brew "graphviz"
brew "icu4c@76"
brew "lsd"
brew "mactop"
brew "mas"
brew "mole"
brew "mpv"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "powerlevel10k"
brew "protobuf"
brew "ruff"
brew "sbt"
brew "speedtest-cli"
brew "tldr"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "codecrafters-io/tap/codecrafters"
brew "quarylabs/quary/sqruff"
cask "bruno"
cask "claude"
cask "dbeaver-community"
cask "ghostty"
cask "jetbrains-toolbox"
cask "marta"
cask "microsoft-teams"
cask "openvpn-connect"
cask "orbstack"
cask "proton-mail"
cask "stats"
cask "temurin@11"
cask "temurin@17"
cask "visual-studio-code"
cask "vlc"
mas "Bitwarden", id: 1352778147
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother iPrint&Scan", id: 1193539993
mas "Dropzone 4", id: 1485052491
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MonitorControlLite", id: 1595464182
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Proton Pass for Safari", id: 6502835663
mas "Save to Raindrop.io", id: 1549370672
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Usage", id: 1561788435
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onedark"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "azemoh.one-monokai"
vscode "charliermarsh.ruff"
vscode "codely.codely-theme"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mjpvs.latex-previewer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "synapsevscode.synapse"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-upgrade"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
cargo "loco-cli"
cargo "rustlings"
